/*
Цей клас (AddMenu) представляє меню додавання,
де користувач може вибрати опції для додавання нових факультетів, кафедр до факультета,
а також додавання нових студентів/викладачів до кафедри.
 */
public class AddMenu {
    public AddMenu() {
    }

    public static void run() {
        while (true) {
            char act = DataInput.getChar("Введіть номер дії, яку хочете виконати:\n" +
                    "1. Додати факультет\n" +
                    "2. Додати кафедру до факультета\n" +
                    "3. Додати студента до кафедри\n" +
                    "4. Додати викладача до кафедри\n" +
                    "b. Повернутися до головного меню");

            switch (act) {
                case '1':
                    // додавання факультетів
                    break;
                case '2':
                    // додавання кафедр до факультета
                    break;
                case '3':
                    // додавання студентів до кафедри
                    break;
                case '4':
                    // додавання викладачів до кафедри
                    break;
                case 'b':
                    return;
                default:
                    System.out.println("Ви ввели невірну команду");
            }
        }
    }
}
