/*
Цей клас (EditMenu) представляє меню редагування, де користувач може вибрати опції для створення,
видалення або редагування факультетів, кафедр факультета,
а також додавання, видалення або редагування студентів/викладачів до кафедри.
*/
public class EditMenu {
    public EditMenu() {
    }

    public static void run() {
        while (true) {
            String act = DataInput.getString("Введіть номер дії, яку хочете виконати:\n" +
                    "1. Видалити факультет\n" +
                    "2. Редагувати факультет\n" +
                    "3. Видалити кафедру факультета\n" +
                    "4. Редагувати кафедру факультета\n" +
                    "5. Редагувати студента кафедри\n" +
                    "6. Редагувати викладача кафедри\n" +
                    "b. Повернутися до головного меню");

            switch (act) {
                case "1":
                    // створення факультету
                    break;
                case "2":
                    // видалення факультету
                    break;
                case "3":
                    // редагування факультету
                    break;
                case "4":
                    // створення кафедри факультета
                    break;
                case "5":
                    // видалення кафедри факультета
                    break;
                case "6":
                    // редагування кафедри факультета
                    break;
                case "7":
                    // додавання студента до кафедри
                    break;
                case "8":
                    // видалення студента з кафедри
                    break;
                case "b":
                    return;
                default:
                    System.out.println("Ви ввели невірну команду");
            }
        }
    }


}
