/*
Цей клас (EditMenu) представляє меню редагування, де користувач може вибрати опції для створення,
видалення або редагування факультетів, кафедр факультета,
а також додавання, видалення або редагування студентів/викладачів до кафедри.
*/
public class EditMenu {
    public EditMenu() {
    }

    public void run() {
        while (true) {
            char act = DataInput.getChar("Введіть номер дії, яку хочете виконати:\n" +
                    "1. Створити/видалити/редагувати факультет\n" +
                    "2. Створити/видалити/редагувати кафедру факультета\n" +
                    "3. Додати/видалити/редагувати студента/викладача до кафедри\n" +
                    "4. Знайти студента/викладача за ПІБ, курсом або групою\n" +
                    "b. Повернутися до головного меню");

            switch (act) {
                case '1':
                    // редагування факультетів
                    break;
                case '2':
                    // редагування кафедр факультета
                    break;
                case '3':
                    // додавання/видалення/редагування студентів/викладачів до кафедри
                    break;
                case '4':
                    // пошук студентів/викладачів за ПІБ, курсом або групою
                    break;
                case 'b':
                    return;
                default:
                    System.out.println("Ви ввели невірну команду");
            }
        }
    }
}
