/*
Цей клас (EditMenu) представляє меню редагування, де користувач може вибрати опції для створення,
видалення або редагування факультетів, кафедр факультета,
а також додавання, видалення або редагування студентів/викладачів до кафедри.
*/
public class EditMenu {
    public EditMenu() {
    }

    public static void run() {
        while (true) {
            String act = DataInput.getString("Введіть номер дії, яку хочете виконати:\n" +
                    "1. Створити факультет\n" +
                    "2. Видалити факультет\n" +
                    "3. Редагувати факультет\n" +
                    "4. Створити кафедру факультета\n" +
                    "5. Видалити кафедру факультета\n" +
                    "6. Редагувати кафедру факультета\n" +
                    "7. Додати студента до кафедри\n" +
                    "8. Видалити студента з кафедри\n" +
                    "9. Редагувати студента кафедри\n" +
                    "10. Додати викладача до кафедри\n" +
                    "11. Видалити викладача з кафедри\n" +
                    "12. Редагувати викладача кафедри\n" +
                    "13. Знайти студента за ПІБ, курсом або групою\n" +
                    "14. Знайти викладача за ПІБ або предметом\n" +
                    "b. Повернутися до головного меню");

            switch (act) {
                case "1":
                    // створення факультету
                    break;
                case "2":
                    // видалення факультету
                    break;
                case "3":
                    // редагування факультету
                    break;
                case "4":
                    // створення кафедри факультета
                    break;
                case "5":
                    // видалення кафедри факультета
                    break;
                case "6":
                    // редагування кафедри факультета
                    break;
                case "7":
                    // додавання студента до кафедри
                    break;
                case "8":
                    // видалення студента з кафедри
                    break;
                case "9":
                    // редагування студента кафедри
                    break;
                case "10":
                    // додавання викладача до кафедри
                    break;
                case "11":
                    // видалення викладача з кафедри
                    break;
                case "12":
                    // редагування викладача кафедри
                    break;
                case "13":
                    // пошук студента за ПІБ, курсом або групою
                    break;
                case "14":
                    // пошук викладача за ПІБ або предметом
                    break;
                case "b":
                    return;
                default:
                    System.out.println("Ви ввели невірну команду");
            }
        }
    }


}
