/*
Цей клас (StatMenu) представляє меню статистики,
де користувач може вибрати опції для виведення різних статистичних даних
 */
public class StatMenu {
    public StatMenu() {
    }

    public void run() {
        while (true) {
            char act = DataInput.getChar("Введіть номер дії, яку хочете виконати:\n" +
                    "1. Вивести всіх студентів впорядкованих за курсами\n" +
                    "2. Вивести всіх студентів/викладачів факультета впорядкованих за алфавітом\n" +
                    "3. Вивести всіх студентів кафедри впорядкованих за курсами\n" +
                    "4. Вивести всіх студентів/викладачів кафедри впорядкованих за алфавітом\n" +
                    "5. Вивести всіх студентів кафедри вказаного курсу\n" +
                    "6. Вивести всіх студентів кафедри вказаного курсу впорядкованих за алфавітом\n" +
                    "b. Повернутися до головного меню");

            switch (act) {
                case '1':
                    // виведення всіх студентів впорядкованих за курсами
                    break;
                case '2':
                    // виведення всіх студентів/викладачів факультета впорядкованих за алфавітом
                    break;
                case '3':
                    // виведення всіх студентів кафедри впорядкованих за курсами
                    break;
                case '4':
                    // виведення всіх студентів/викладачів кафедри впорядкованих за алфавітом
                    break;
                case '5':
                    // виведення всіх студентів кафедри вказаного курсу
                    break;
                case '6':
                    // виведення всіх студентів кафедри вказаного курсу впорядкованих за алфавітом
                    break;
                case 'b':
                    return;
                default:
                    System.out.println("Ви ввели невірну команду");
            }
        }
    }
}
